OpenFOAM-v1812/tutorials/compressible/rhoSimpleFoam/angledDuctExplicitFixedCoeff/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

m4 system/blockMeshDict.m4 > system/blockMeshDict

runApplication blockMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
